TexasInstruments/ble_examples/source/ti/blestack/boards/CC2640R2DK_7ID/CC2640R2DK_7ID.c
const GPTimerCC26XX_Config GPTimerCC26XX_config[CC2640R2DK_7ID_GPTIMERPARTSCOUNT] = {
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER0], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER0A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER0], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER0B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER1], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER1A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER1], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER1B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER2], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER2A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER2], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER2B], GPT_B },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER3], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER3A], GPT_A },
    { &gptimerCC26XXObjects[CC2640R2DK_7ID_GPTIMER3], &gptimerCC26xxHWAttrs[CC2640R2DK_7ID_GPTIMER3B], GPT_B },
};

/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {

    CC2640R2DK_7ID_PIN_LED1 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_7ID_PIN_LED2 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_7ID_PIN_LED3 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_7ID_PIN_LED4 | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,  /* LED initially off */
    CC2640R2DK_7ID_KEY_SELECT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                   /* Button is active low */
    CC2640R2DK_7ID_KEY_UP | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                       /* Button is active low */
    CC2640R2DK_7ID_KEY_DOWN | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                     /* Button is active low */
    CC2640R2DK_7ID_KEY_LEFT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                     /* Button is active low */
    CC2640R2DK_7ID_KEY_RIGHT | PIN_INPUT_EN | PIN_PULLUP | PIN_HYSTERESIS,                    /* Button is active low */
    CC2640R2DK_7ID_3V3_EN | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL,                 /* 3V3 domain off initially */
    CC2640R2DK_7ID_LCD_MODE | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,              /* LCD pin high initially */
    CC2640R2DK_7ID_LCD_RST | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,               /* LCD pin high initially */
    CC2640R2DK_7ID_LCD_CSN | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,               /* LCD CSn deasserted initially */
    CC2640R2DK_7ID_ALS_PWR | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL,                /* ALS power off initially */
    CC2640R2DK_7ID_ACC_PWR | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL,                /* ACC power off initially */
    CC2640R2DK_7ID_ACC_CSN | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,               /* ACC CSn deasserted initially */
    CC2640R2DK_7ID_SDCARD_CSN | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,            /* SDCARD CSn deasserted initially */
    CC2640R2DK_7ID_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,               /* UART TX pin at inactive level */

    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = TRUE,
    .calibrateRCOSC_LF  = TRUE,
    .calibrateRCOSC_HF  = TRUE,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWMCOUNT] = {
    { .pwmPin = CC2640R2DK_7ID_PWMPIN0, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER0A },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN1, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER0B },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN2, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER1A },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN3, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER1B },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN4, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER2A },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN5, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER2B },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN6, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER3A },
    { .pwmPin = CC2640R2DK_7ID_PWMPIN7, .gpTimerUnit = CC2640R2DK_7ID_GPTIMER3B },
};

const PWM_Config PWM_config[CC2640R2DK_7ID_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM0], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM0] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM1], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM2], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM3], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM4], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM5], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM6], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC2640R2DK_7ID_PWM7], &pwmtimerCC26xxHWAttrs[CC2640R2DK_7ID_PWM7] },
};

const uint_least8_t PWM_count = CC2640R2DK_7ID_PWMCOUNT;

